README.org
#+title: Doom Emacs Configuration
#+author: Vedant "cupkax" Sansare
#+startup: fold
#+property: header-args:emacs-lisp :tangle "config.el" :results silent

* Doom Core
** =init.el=
:PROPERTIES:
:header-args:emacs-lisp: :tangle no
:END:
#+name: init.el
#+begin_src emacs-lisp :tangle "init.el" :noweb no-export :comments none
;;; init.el -*- lexical-binding: t; -*-
(doom!
 :completion
 <<doom-completion>>

 :ui
 <<doom-ui>>

 :editor
 <<doom-editor>>

 :emacs
 <<doom-emacs>>

 :term
 <<doom-term>>

 :checkers
 <<doom-checkers>>

 :tools
 <<doom-tools>>

 :os
 <<doom-os>>

 :lang
 <<doom-lang>>

 :email
 <<doom-email>>

 :app
 <<doom-app>>

 :config
 <<doom-config>>
 )
#+end_src

*** doom-completion
#+name: doom-completion
#+begin_src emacs-lisp
(company
 +childframe)
(ivy
 +childframe
 +prescient
 +icons
 +fuzzy)
#+end_src
*** doom-ui
#+name: doom-ui
#+begin_src emacs-lisp
deft
doom
doom-dashboard
doom-quit
hl-todo
hydra
ligatures
modeline
nav-flash
ophints
(popup
 +all
 +defaults)
treemacs
                                        ;unicode
vc-gutter
vi-tilde-fringe
(window-select
 +numbers)
workspaces
zen
#+end_src
*** doom-editor
#+name: doom-editor
#+begin_src emacs-lisp
(evil
 +everywhere)
file-templates
fold
(format
 +onsave)
multiple-cursors
rotate-text
snippets
word-wrap
#+end_src
*** doom-emacs
#+name: doom-emacs
#+begin_src emacs-lisp
(dired
 +ranger
 +icons)
electric
(ibuffer +icons)
(undo +tree)
vc
#+end_src
*** doom-term
#+name: doom-term
#+begin_src emacs-lisp
vterm
#+end_src
*** doom-checkers
#+name: doom-checkers
#+begin_src emacs-lisp
(syntax
 +childframe)
spell
grammar
#+end_src
*** doom-tools
#+name: doom-tools
#+begin_src emacs-lisp
direnv
editorconfig
(eval
 +overlay)
gist
(lookup
 +offline
 +dictionary
 +docsets)
lsp
(magit)
make
pdf
rgb
#+end_src
*** doom-os
#+name: doom-os
#+begin_src emacs-lisp
tty
#+end_src
*** doom-lang
#+name: doom-lang
#+begin_src emacs-lisp
(csharp
 +lsp)
data
emacs-lisp
json
(javascript
 +lsp)
ledger
lua
markdown
(org
 +dragndrop
 +gnuplot
 +hugo
 +pandoc
 +pretty
 +roam)
(python
 +poetry
 +lsp)
scheme
sh
web
yaml
#+end_src
*** doom-email
#+name: doom-email
#+begin_src emacs-lisp
(mu4e
 +org
 +gmail)
#+end_src
*** doom-app
#+name: doom-app
#+begin_src emacs-lisp
;;calendar
;;irc               ; how neckbeards socialize
;;(rss +org)        ; emacs as an RSS reader
;;twitter           ; twitter client https://twitter.com/vnought
;;write             ; emacs for writers (fiction, notes, papers, etc.)
#+end_src
*** doom-config
#+name: doom-config
#+begin_src emacs-lisp
;literate
(default
  +bindings
  +smartparens)
#+end_src

** =package.el=
:PROPERTIES:
:header-args:emacs-lisp: :tangle "packages.el" :comments no
:END:
*** Prevent Byte Compile
#+begin_src emacs-lisp
;; -*- no-byte-compile: t; -*-
#+end_src
*** Aesthetics
**** Beacon
#+begin_src emacs-lisp
(package! beacon)
#+end_src
**** Bufler
#+begin_src emacs-lisp
(package! bufler)
#+end_src
**** Dired Icons
#+begin_src emacs-lisp
(package! all-the-icons-dired)
#+end_src
**** Evil Better Visual Line
#+begin_src emacs-lisp
(package! evil-better-visual-line)
#+end_src
**** Info Colors
#+begin_src emacs-lisp
(package! info-colors )
#+end_src

**** Rotate
#+begin_src emacs-lisp
(package! rotate)
#+end_src
*** Keybindings
#+begin_src emacs-lisp
(package! general)
#+end_src
*** Magit
**** Magit Delta
#+begin_src emacs-lisp
(package! magit-delta
  :recipe (:host github
           :repo "dandavison/magit-delta"))
#+end_src

*** Flycheck
#+begin_src emacs-lisp
(package! package-lint)
;(package! flycheck-package)
#+end_src

*** Ebooks
**** EPUBS major mode =nov.el=
#+begin_src emacs-lisp
(package! nov)
#+end_src

**** Calibre
#+begin_src emacs-lisp
(package! calibredb)
#+end_src

*** Org
**** Visuals
***** Tables
#+begin_src emacs-lisp
(package! org-pretty-table-mode
  :recipe (:host github
           :repo "Fuco1/org-pretty-table"))
#+end_src
***** Tags
#+begin_src emacs-lisp
(package! org-pretty-tags)
#+end_src

***** Priorities
#+begin_src emacs-lisp
(package! org-fancy-priorities)
#+end_src
**** Org Capture
#+begin_src emacs-lisp
(package! doct)
#+end_src
**** Org Chef
#+begin_src emacs-lisp
(package! org-chef)
#+end_src
**** Org Download
#+begin_src emacs-lisp
(package! org-download
  :recipe (:host github
            :repo "abo-abo/org-download"))
#+end_src

**** Org Helm Rifle
#+begin_src emacs-lisp
(package! helm-org-rifle)
#+end_src

#+begin_src emacs-lisp
(package! helm-org-rifle)
#+end_src

**** Org Mindmap
#+begin_src emacs-lisp
(package! org-mind-map
  :recipe (:host github
            :repo "theodorewiles/org-mind-map"))
#+end_src
**** Org Noter
#+begin_src emacs-lisp
(package! org-noter)
#+end_src
**** Org Pandoc
#+begin_src emacs-lisp
(package! ox-pandoc)
#+end_src
**** Org Protocol
#+begin_src emacs-lisp
(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))
#+end_src
**** Org Ref
#+begin_src emacs-lisp
(package! org-ref)
#+end_src
**** Org Roam
***** Company Org Roam
#+begin_src emacs-lisp
(package! company-org-roam)
#+end_src
***** Org Roam Bibtex
#+begin_src emacs-lisp
(package! org-roam-bibtex)
#+end_src
***** Org Roam Server
#+begin_src emacs-lisp
(package! org-roam-server)
#+end_src
**** Org Super Agenda
#+begin_src emacs-lisp
(package! org-super-agenda)
#+end_src

*** Zotero
#+begin_src emacs-lisp
(package! zotxt)
#+end_src

* Lexical Bindings
#+begin_src emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+end_src

* Personal Information
#+begin_src emacs-lisp
(setq user-full-name "Vedant Sansare (cupkax)"
      user-mail-address "vedantsansare23@gmail.com")
#+end_src

* Startup
** Better Defaults
#+begin_src emacs-lisp
(setq undo-limit 80000000)
(setq evil-want-fine-undo t)
(setq auto-save-default t)
#+end_src
** =custom.el=
#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

** =utf-8-unix= System
#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

(prefer-coding-system 'utf-8-unix)
(set-default-coding-systems 'utf-8)
#+end_src

* Visual Settings
** Fonts
#+begin_src emacs-lisp
(setq doom-font                (font-spec :family "FiraCode Nerd Font" :size 16))
(setq doom-big-font            (font-spec :family "FiraCode Nerd Font" :size 20))
(setq doom-variable-pitch-font (font-spec :family "Overpass Nerd Font" :size 16))
(setq doom-serif-font          (font-spec :family "BlexMono Nerd Font" :weight 'light))
#+end_src

** Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-palenight)
#+end_src

** Modeline
*** Change red text
#+begin_src emacs-lisp
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "grey"))
#+end_src

*** Show time
#+begin_src emacs-lisp
(setq display-time-24hr-format t)
(display-time-mode 1)
#+end_src

** Info Colors
#+begin_src emacs-lisp
(use-package! info-colors
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook 'info-colors-fontify-node)

(add-hook 'Info-mode-hook #'mixed-pitch-mode)
#+end_src

* Keybindings
** Change local leader
#+begin_src emacs-lisp
(setq doom-localleader-key ",")
#+end_src

** General
*** Initial Config
#+begin_src emacs-lisp
(use-package! general)
(defconst my-leader "SPC")
(general-create-definer my-leader-def
  :prefix my-leader)
(general-create-definer my-local-leader-def
  :prefix my-local-leader
  :prefix ",")
#+end_src
*** Evil Setup and Error Handling
#+begin_src emacs-lisp
(general-evil-setup t)
(general-auto-unbind-keys)
#+end_src
** Which-key
*** Key delay
#+begin_src emacs-lisp
(setq which-key-idle-delay 0.0)
#+end_src

*** Replace =evil= with unicode symbols
#+begin_src emacs-lisp
(setq which-key-allow-multiple-replacements t)
(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
   ))
#+end_src

* Navigation
** Deft
#+begin_src emacs-lisp
(use-package deft
      :after org
      :bind
      ("C-c n d" . deft)
      :custom
      (deft-recursive t)
      (deft-use-filter-string-for-filename t)
      (deft-default-extension "org")
      (deft-directory "~/git/phd/notes/"))
#+end_src

* Buffer, Frame and Window Configuration
** Buffer Config
*** Better Buffers
#+begin_src emacs-lisp
(use-package! bufler
  :general
  (:keymaps 'doom-leader-map
   "b b" 'bufler-workspace-switch-buffer
   "b B" 'bufler-switch-buffer)
  :config
  (setq bufler-workspace-switch-buffer-sets-workspace t))
#+end_src
** Window Config
*** Window Resize
#+begin_src emacs-lisp
(setq-default window-combination-resize t)
#+end_src

* Development
** Language
*** Plaintext
#+begin_src emacs-lisp
(after! text-mode
  (add-hook! 'text-mode-hook
    (with-silent-modifications
      (ansi-color-apply-on-region (point-min) (point-max)))))
#+end_src

** Productivity
*** Flycheck
#+begin_src emacs-lisp
#+end_src
*** Company
**** Company mode
#+begin_src emacs-lisp
(after! company
  (setq company-idle-delay 0.5
        company-minimum-prefix-length 2)
  (setq company-show-numbers t)
  (add-hook 'evil-normal-state-entry-hook #'company-abort))
#+end_src

**** Company Prescient
#+begin_src emacs-lisp
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+end_src

**** Company backend
#+begin_src emacs-lisp
(set-company-backend!
  '(text-mode
    markdown-mode
    gfm-mode)
  '(:seperate
    company-ispell
    company-files
    company-yasnippet))
#+end_src

* Org Mode
** Basic Config
#+begin_src emacs-lisp
(setq org-directory                     "~/git/phd/notes/"
      org-use-property-inheritance      t
      org-log-done                      'time
      org-list-allow-alphabetical       t
      org-catch-invisible-edits         'smart
      org-cycle-separator-lines              0)
#+end_src
** Org Rifle
#+begin_src emacs-lisp
(use-package! helm-org-rifle
  :after org
  :general
  (:keymaps 'org-mode-map
            :states 'normal
            :prefix my-leader
            "m r"     '(:ignore t                       :wk "Rifle (Helm)")
            "m r b"   '(helm-org-rifle-current-buffer   :wk "Rifle buffer")
            "m r e"   '(helm-org-rifle                  :wk "Rifle every open buffer")
            "m r d"   '(helm-org-rifle-directory        :wk "Rifle from org-directory")
            "m r a"   '(helm-org-rifle-agenda-files     :wk "Rifle agenda")
            "m r o"   '(:ignore t                       :wk "Occur (Persistent)")
            "m r o b" '(helm-org-rifle-current-buffer   :wk "Rifle buffer")
            "m r o e" '(helm-org-rifle                  :wk "Rifle every open buffer")
            "m r o d" '(helm-org-rifle-directory        :wk "Rifle from org-directory")
            "m r o a" '(helm-org-rifle-agenda-files     :wk "Rifle agenda")
            ))
#+end_src
** Org Mind Map
#+begin_src emacs-lisp
(use-package! org-mind-map
  :general
  (:keymaps 'org-mode-map
            :states 'normal
            :prefix my-leader
            "m e m" '(org-mind-map-write :wk "Export mind-map") ))
#+end_src
** Org-Ref
#+begin_src emacs-lisp
(use-package! org-ref
    :after org
    :init
    ; code to run before loading org-ref
    :config
    ; code to run after loading
    ; org-ref
    
    (setq
     org-ref-completion-library        'org-ref-ivy-cite
     org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex
     org-ref-bibliography-notes        "~/git/phd/notes/bibnotes.org"
     org-ref-note-title-format         "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
     org-ref-notes-directory           "~/git/phd/notes"
     org-ref-default-bibliography      '("~/Dropbox/org/research/zotLib.bib")
     org-ref-pdf-directory             "~/Dropbox/org/research/zotero-library"
     org-ref-notes-function            'orb-edit-notes))
#+end_src
** Org-Roam
*** Basic Config
#+begin_src emacs-lisp
(setq org-roam-directory "~/git/phd/notes/")
#+end_src
*** Org Roam Bibtex
#+begin_src emacs-lisp
(use-package! org-roam-bibtex
  :after (org-roam)
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
 (setq orb-preformat-keywords
      '("citekey" "title" "url" "author-or-editor" "keywords" "file")
      orb-process-file-keyword t
      orb-file-field-extensions '("pdf"))
 (setq orb-templates
      '(("r" "ref" plain (function org-roam-capture--get-point)
         ""
         :file-name "${citekey}"
         :head "#+TITLE: ${citekey}: ${title}\n#+ROAM_KEY: ${ref}

- tags ::
- keywords :: ${keywords}

,* ${title}
:PROPERTIES:
:Custom_ID: ${citekey}
:URL: ${url}
:AUTHOR: ${author-or-editor}
:NOTER_DOCUMENT: %(orb-process-file-field \"${citekey}\")
:NOTER_PAGE:
:END:"))))
#+end_src
** Helm Bibtex
#+begin_src emacs-lisp
(setq bibtex-format-citation-functions
      '((org-mode . (lambda (x) (insert (concat
                                         "\\cite{"
                                         (mapconcat 'identity x ",")
                                         "}")) ""))))


(setq
 bibtex-completion-notes-path   "~/git/phd/notes/"
 bibtex-completion-bibliography "~/Dropbox/org/research/zotLib.bib"
 bibtex-completion-library-path "~/Dropbox/org/research/zotero-library/"
 bibtex-completion-pdf-field    "file"
 bibtex-completion-notes-template-multiple-files
   (concat
    "#+TITLE: ${title}\n"
    "#+ROAM_KEY: cite:${=key=}\n"
    "#+ROAM_TAGS: ${keywords}\n"
    "* TODO Notes\n"
    ":PROPERTIES:\n"
    ":Custom_ID: ${=key=}\n"
    ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
    ":AUTHOR: ${author-abbrev}\n"
    ":JOURNAL: ${journaltitle}\n"
    ":DATE: ${date}\n"
    ":YEAR: ${year}\n"
    ":DOI: ${doi}\n"
    ":URL: ${url}\n"
    ":END:\n\n"))
#+end_src
** Org Noter
#+begin_src emacs-lisp
(map! :localleader
      :map (org-mode-map pdf-view-mode-map)
      (:prefix ("o" . "Org")
       (:prefix ("n" . "Noter")
        :desc "Noter" "n" 'org-noter
        )))

(use-package! org-noter
  :after (:any org pdf-view)
  :config
  (setq
   org-noter-hide-other nil
   ;; Everything is relative to the rclone mega
   org-noter-notes-search-path (list "~/git/phd/notes/")))
#+end_src
** Pandoc
#+begin_src emacs-lisp
(use-package! ox-pandoc
  :after org)
;; default options for all output formats
(setq org-pandoc-options '((standalone . _)))
;; cancel above settings only for 'docx' format
(setq org-pandoc-options-for-docx '((standalone . nil)))
;; special extensions for markdown_github output
(setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))
#+end_src
* Writing
** Dictionary
#+begin_src emacs-lisp
(setq ispell-dictionary "en-custom")
(setq ispell-personal-dictionary (expand-file-name ".ispell_personal" doom-private-dir))
#+end_src
* Applications
** PDF Tools
#+begin_src emacs-lisp
(after! pdf-view
  (setq-default pdf-view-display-size 'fit-width)
  (setq pdf-annot-activate-created-annotations t
        pdf-view-resize-factor 1.1)
  (map!
   :map pdf-view-mode-map
   :n "g g"          #'pdf-view-first-page
   :n "G"            #'pdf-view-last-page
   :n "N"            #'pdf-view-next-page-command
   :n "E"            #'pdf-view-previous-page-command
   :n "e"            #'evil-collection-pdf-view-previous-line-or-previous-page
   :n "n"            #'evil-collection-pdf-view-next-line-or-next-page
   :localleader
   (:prefix "o"
    (:prefix "n"
     :desc "Insert" "i" 'org-noter-insert-note
     ))))
#+end_src

** Zotero (zotxt)
#+begin_src emacs-lisp
(use-package! zotxt
  :after org)
#+end_src
